app/Livewire/Forms/ItemForm.php

    public function update()
    {
        $this->validate();
        $this->item->update($this->all());
---
update `items` set `has_inventory` = '1', `items`.`updated_at` = '2024-03-16 11:31:15' where `id` = 2