routes/web.php

select `id`, `name`, `price`, `stock` from `items`
select count(*) as aggregate from `items`
select count(*) as aggregate from `categories`
---
        return view('dashboard');
    })->name('dashboard');

    Route::get('/sell', function () {
        $items = Item::all(
            'id',
            'name',
            'price',
            'stock',
        );
        return view('sell', compact('items'));
    })->name('sell');

    Route::get('/inventory', function () {
        $itemCount = Item::count();
        $categoryCount = Category::count();
        return view('inventory/index', compact('itemCount', 'categoryCount'));
    })->name('inventory');