app/Livewire/Items/SaleHistory.php

    public function render()
    {
        return view('livewire.items.sale-history')->with('sales', SaleDetail::where('item_id', $this->item_id)->paginate(10));
---
select * from `sales` where `item_id` = 2 limit 10 offset 0
select count(*) as aggregate from `sales` where `item_id` = 2
select * from `sale_details` where `item_id` = 2 limit 10 offset 0
select count(*) as aggregate from `sale_details` where `item_id` = 2