app/Livewire/CategoryTable.php

    public function render()
    {
        return view('livewire.category-table', [
            'categories' => Category::where('name', 'like', '%' . $this->search . '%')
                ->orWhere('description', 'like', '%' . $this->search . '%')
                ->paginate(10)

        ]);
---
select * from `categories` where `name` like '%%' or `description` like '%%' limit 10 offset 0
select count(*) as aggregate from `categories` where `name` like '%%' or `description` like '%%'