app/Livewire/ConfirmSaleModal.php

    public function confirmSale()
    {
        if ($this->sale->saleDetails->isEmpty()) {
            return;
        }
        $this->sale->update([
            'paid' => true,
        ]);
---
update `sales` set `paid` = 1, `sales`.`updated_at` = '2024-03-15 16:28:46' where `id` = 7

    public function updateStock()
    {
        foreach ($this->sale->saleDetails as $saleDetail) {
            $saleDetail->item->update([
                'stock' => $saleDetail->item->stock - $saleDetail->quantity,
            ]);
---
update `items` set `stock` = 2, `items`.`updated_at` = '2024-03-15 16:28:46' where `id` = 2