app/Livewire/DaySales.php

select * from `sales` where date(`created_at`) = '2024-03-15'
---
    public function getSales()
    {
        $this->sales = Sale::whereDate('created_at', $this->date)->get();