app/Livewire/IncomesChart.php

    public function render()
    {
        return view('livewire.incomes-chart', [
            // total sales by month
            'incomes' => Sale::selectRaw('sum(total) as incomes, month(created_at) as month')
                ->whereYear('created_at', date('Y'))
                ->groupBy('month')
                ->pluck('incomes', 'month')
        ]);
---
select sum(total) as total, month(created_at) as month from `sales` where year(`created_at`) = '2024' group by `month`