app/Livewire/ItemTable.php

select `name`, `id` from `categories`
---
                    function (Builder $builder, string $value) {
                        if ($value == '') {
                            return $builder;
                        } else if ($value == '1') {
                            return $builder->whereNotNull('stock');
                        } else if ($value == '2') {
                            return $builder->whereNull('stock');
                        }
                    }
                ),
            SelectFilter::make('Categoria')
                ->options(
                    Category::pluck('name', 'id')->toArray()
                )
                ->filter(
                    function (Builder $builder, $value) {
                        return $builder->where('category_id', $value);
                    }
                ),