app/Livewire/MonthTable.php

select DATE(created_at) as date, SUM(total) as total from `sales` where month(`created_at`) = '03' and year(`created_at`) = '2024' group by `date` order by `date` asc
---
    public function render()
    {

        return view(
            'livewire.month-table',
            [
                'sales' => Sale::select(DB::raw('DATE(created_at) as date'), DB::raw('SUM(total) as total'))
                    ->whereMonth('created_at', date('m', strtotime($this->date)))
                    ->whereYear('created_at', date('Y', strtotime($this->date)))
                    ->groupBy('date')
                    ->orderBy('date', 'asc')
                    ->get()
            ]
        );