app/Livewire/NewItem.php

select * from `categories`
---
    public function mount()
    {
        $this->categories = Category::all();