app/Livewire/Salescount.php

    public function render()
    {
        $this->salescount = Sale::count();
---
select count(*) as aggregate from `sales`