app/Livewire/SalesTable.php

select * from `sale_details` where `sale_id` = 3
---
    public function mount(): void
    {
        $this->saleDetails = SaleDetail::where('sale_id', $this->sale->id)->get();

delete from `sale_details` where `id` = 8
select * from `sale_details` where `sale_details`.`id` = 8 limit 1
select * from `sale_details` where `sale_id` = 1
select * from `sales` where date(`created_at`) = '2024-03-16'
---
    public function deleteSaleDetail(int $id): void
    {
        SaleDetail::find($id)->delete();
        $this->saleDetails = SaleDetail::where('sale_id', $this->sale->id)->get();
        $this->sale->update([
            'total' => $this->saleDetails->sum('total')
        ]);