app/Livewire/SellForm.php

insert into `sales` (`item_id`, `quantity`, `total`, `updated_at`, `created_at`) values ('5', 1, 799.99, '2024-03-16 12:44:25', '2024-03-16 12:44:25')
---
    public function save()
    {
        $this->validateInput();

        Sale::create([
            'item_id' => $this->selectedItem,
            'quantity' => $this->quantity,
            'total' => $this->total,
        ]);