app/Livewire/SellForm.php

select * from `sale_details`
insert into `sales` (`paid`, `total`, `updated_at`, `created_at`) values (0, 0, '2024-03-15 16:29:53', '2024-03-15 16:29:53')
select * from `sales` where `paid` = 0 order by `created_at` desc limit 1
---
    public function mount()
    {
        $this->loadItems();
        $this->saleDetails = SaleDetail::all();
        $this->sale = Sale::where('paid', false)->latest()->first() ?? Sale::create(
            [
                'paid' => false,
                'total' => 0,
            ]
        );

select `id`, `name`, `brand` from `items`
---
    public function loadItems()
    {
        $this->items = Item::all(['id', 'name', 'brand']);

select * from `items` where `items`.`id` = '1' limit 1
---
    public function getItem()
    {
        return Item::find($this->selectedItem);

update `items` set `stock` = 6, `items`.`updated_at` = '2024-03-15 18:17:26' where `id` = 2
---
    public function updateStock()
    {
        $item = $this->getItem();
        if ($item->stock == null) {
            return;
        }
        $item->stock = $item->stock - $this->quantity;
        $item->save();

select * from `items` where `items`.`id` = '2' limit 1
---
    public function checkStock($selectedItem)
    {
        $item = Item::find($selectedItem);

update `sales` set `total` = 1089.98, `sales`.`updated_at` = '2024-03-15 13:15:18' where `id` = 1
update `sale_details` set `quantity` = 2, `total` = 579.98, `sale_details`.`updated_at` = '2024-03-15 18:17:26' where `id` = 20
select * from `sale_details` where `sale_details`.`sale_id` = 1 and `sale_details`.`sale_id` is not null
insert into `sale_details` (`sale_id`, `item_id`, `quantity`, `total`, `updated_at`, `created_at`) values (3, '1', 1, 154.99, '2024-03-16 12:15:36', '2024-03-16 12:15:36')
update `sales` set `total` = 5, `sales`.`updated_at` = '2024-03-16 11:46:17' where `id` = 1
---
    public function addToCart()
    {
        $this->validateInput();
        if ($this->stock < $this->quantity) {
            $this->dispatch('noStock');
            return;
        }

        $itemInCart = $this->sale->saleDetails->where('item_id', $this->selectedItem)->first();
        if ($itemInCart) {
            $itemInCart->quantity += $this->quantity;
            $itemInCart->total += $this->total;
            $itemInCart->save();
            $this->updateStock();
            $this->dispatch('saleAdded', selectedItem: $this->selectedItem);
            $this->dispatch('updateSales');
            $this->resetForm();
            return;
        }

        SaleDetail::create([
            'sale_id' => $this->sale->id,
            'item_id' => $this->selectedItem,
            'quantity' => $this->quantity,
            'total' => $this->total,
        ]);

        $this->sale->total += $this->total;
        $this->sale->save();