app/Livewire/TotalIncomes.php

select sum(`total`) as aggregate from `sales`
---
    public function render()
    {
        $totalIncomes = Sale::sum('total');