app/Livewire/UpdateBusinessInformation.php

    public function updateBusinessInfo()
    {
        $this->validate([
            'name' => 'required|min:3',
            'address' => 'required',
            'phone' => 'required',
            'email' => 'required',
            'ruc' => 'required',
        ]);
        if (Business::first()) {
            Business::first()->update([
                'name' => $this->name,
                'address' => $this->address,
                'phone' => $this->phone,
                'email' => $this->email,
                'ruc' => $this->ruc,
                'logo' => $this->logo,
                'web' => $this->web,
            ]);
        } else {
            Business::create([
                'name' => $this->name,
                'address' => $this->address,
                'phone' => $this->phone,
                'email' => $this->email,
                'ruc' => $this->ruc,
                'logo' => $this->logo,
                'web' => $this->web,
            ]);
---
select * from `businesses` limit 1
insert into `businesses` (`name`, `address`, `phone`, `email`, `ruc`, `logo`, `web`, `updated_at`, `created_at`) values ('PAPELERIA LITA', 'LITA', '0960759518', 'arielferaguirre.2001@gmail.com', 'arielferaguirre.2001@gmail.com', '', '', '2024-03-15 19:06:26', '2024-03-15 19:06:26')