app/Http/Controllers/ItemController.php

    public function index()
    {
        return view('items/index', [
            'items' => Item::all(),
        ]);
---
select * from `items`

    public function show(Item $item)
    {
        $item = Item::find($item->id);
        $sales = DB::table('sales')
            ->where('item_id', $item->id)
            ->get();
---
select * from `items` where `items`.`id` = 2 limit 1
select * from `sales` where `item_id` = 2